<div class="row">
        <div class="col-lg-9">
            <h1>1112.Highest Grade For Each Student</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table: <code>Enrollments</code></p>

<pre>
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| student_id    | int     |
| course_id     | int     |
| grade         | int     |
+---------------+---------+
(student_id, course_id) is the primary key of this table.

</pre>

<p>Write a SQL query to find the highest grade with its corresponding course for each student. In case of a tie, you should find the course with the smallest&nbsp;<code>course_id</code>. The output must be sorted by increasing <code>student_id</code>.</p>

<p>The query result format is in the following example:</p>

<pre>
Enrollments table:
+------------+-------------------+
| student_id | course_id | grade |
+------------+-----------+-------+
| 2          | 2         | 95    |
| 2          | 3         | 95    |
| 1          | 1         | 90    |
| 1          | 2         | 99    |
| 3          | 1         | 80    |
| 3          | 2         | 75    |
| 3          | 3         | 82    |
+------------+-----------+-------+

Result table:
+------------+-------------------+
| student_id | course_id | grade |
+------------+-----------+-------+
| 1          | 2         | 99    |
| 2          | 2         | 95    |
| 3          | 3         | 82    |
+------------+-----------+-------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
Enrollments = pd.read_sql_table("Enrollments", engine)
Enrollments

   student_id  course_id  grade
0           2          2     95
1           2          3     95
2           1          1     90
3           1          2     99
4           3          1     80
5           3          2     75
6           3          3     82

In [3]:
query = '''
SELECT student_id, 
       MIN(course_id) course_id, 
       MIN(grade)
FROM Enrollments
WHERE (student_id, grade) IN 
        (SELECT student_id, MAX(grade) 
        FROM Enrollments
        GROUP BY student_id)
GROUP BY student_id
ORDER BY student_id
'''
pd.read_sql_query(query, engine)

   student_id  course_id  MIN(grade)
0           1          2          99
1           2          2          95
2           3          3          82

NOTE:
1. multiple records in the subquery. need to find the min(course_id) use either min(grade) or max(grade) to get the single record. (no effect since grade will be the same for one user_id)